ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/serial_api.c
/***************************************************************************//**
 * @file serial_api.c
 *******************************************************************************
 * @section License
 * <b>Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License"); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#include "device.h"
#include "clocking.h"

#if DEVICE_SERIAL

#include "mbed_assert.h"
#include "mbed_power_mgmt.h"
#include "serial_api.h"
#include <string.h>
#include <stdbool.h>

#include "pinmap.h"
#include "pinmap_function.h"
#include "PeripheralPins.h"
#include "PeripheralNames.h"

#include "compiler.h"
#include "pic32cx.h"
#include "usart.h"

#define UART_COUNT    1
#define USART_COUNT   8
#define MODULES_SIZE_SERIAL (UART_COUNT + USART_COUNT)

/* Store IRQ id for each UART */
static uint32_t serial_irq_ids[MODULES_SIZE_SERIAL] = { 0 };
/* Interrupt handler from mbed common */
static uart_irq_handler irq_handler;

/* Serial interface on USBTX/USBRX retargets stdio */
int stdio_uart_inited = 0;
serial_t stdio_uart;

void serial_init(serial_t *obj, PinName tx, PinName rx)
{
    /* Get UART object connected to the given pins */
    UARTName uart_tx = (UARTName) pinmap_peripheral(tx, PinMap_UART_TX);
    UARTName uart_rx = (UARTName) pinmap_peripheral(rx, PinMap_UART_RX);
    /* Check that pins are connected to same UART */
    UARTName uart = (UARTName) pinmap_merge(uart_tx, uart_rx);
    MBED_ASSERT((unsigned int) uart != NC);

	/* Set default values */
    obj->p_usart = (Usart *) uart;
	obj->serial_options.charlenght = US_MR_CHRL_8_BIT;
	obj->serial_options.paritytype = US_MR_PAR_NO;
	obj->serial_options.stopbits = US_MR_NBSTOP_1_BIT;
	obj->serial_options.baudrate  = 115200;
    if (uart == STDIO_UART) {
#if MBED_CONF_PLATFORM_STDIO_BAUD_RATE
        obj->serial_options.baudrate  = MBED_CONF_PLATFORM_STDIO_BAUD_RATE; // baudrate takes value from platform/mbed_lib.json
#endif /* MBED_CONF_PLATFORM_STDIO_BAUD_RATE */
    } else {
#if MBED_CONF_PLATFORM_DEFAULT_SERIAL_BAUD_RATE
        obj->serial_options.baudrate  = MBED_CONF_PLATFORM_DEFAULT_SERIAL_BAUD_RATE; // baudrate takes value from platform/mbed_lib.json
#endif /* MBED_CONF_PLATFORM_DEFAULT_SERIAL_BAUD_RATE */
    }

	/* Get flexcom */
	switch (obj->p_usart) {
	case USART_0:
		obj->id_peripheral = ID_FLEXCOM0;
		break;
	case USART_1:
		obj->id_peripheral = ID_FLEXCOM1;
		break;
	case USART_2:
		obj->id_peripheral = ID_FLEXCOM2;
		break;
	case USART_3:
		obj->id_peripheral = ID_FLEXCOM3;
		break;
	case USART_4:
		obj->id_peripheral = ID_FLEXCOM4;
		break;
	case USART_5:
		obj->id_peripheral = ID_FLEXCOM5;
		break;
	case USART_6:
		obj->id_peripheral = ID_FLEXCOM6;
		break;
	case USART_7:
		obj->id_peripheral = ID_FLEXCOM7;
		break;
	}


    /* If this is the UART to be used for stdio, configure pins*/
    if (uart == STDIO_UART) {
		ioport_set_port_mode(PINS_CONSOLE_UART_PORT, PINS_CONSOLE_UART_MASK, PINS_CONSOLE_UART_FLAGS);
	}

	/* Enable the peripheral and set USART mode */
	Flexcom *p_flexcom = obj->p_usart - 0x200;
	flexcom_enable(p_flexcom);
	flexcom_set_opmode(p_flexcom, FLEXCOM_USART);
	
	/* Enable the peripheral clock in the PMC */
	sysclk_enable_peripheral_clock(obj->id_peripheral);

    /* If this is the UART to be used for stdio, copy it to the stdio_uart struct */
    if (uart == STDIO_UART) {
        stdio_uart_inited = 1;
        memcpy(&stdio_uart, obj, sizeof(serial_t));
		
		/* Configure UART for async operation */
		stdio_serial_init(obj->p_usart, &obj->serial_options);
    } else {
		/* Configure USART in serial mode */
		usart_init_rs232(obj->p_usart, &obj->serial_options, sysclk_get_peripheral_hz());

		/* Disable all the interrupts */
		usart_disable_interrupt(obj->p_usart, 0xFFFFFFFF);

		/* Enable the receiver and transmitter */
		serial_enable_tx(obj, true);

		/* Configure and enable interrupt of USART */
		NVIC_EnableIRQ(USART_IRQn);
	}
}

void serial_free(serial_t *obj)
{
	/* Disable the receiver and transmitter */
	usart_disable_tx(obj->p_usart);
	usart_disable_rx(obj->p_usart);
}

static void serial_enable(serial_t *obj, uint8_t enable)
{
	if (enable) {
		/* Enable the receiver and transmitter */
		usart_enable_tx(obj->p_usart);
		usart_enable_rx(obj->p_usart);
	} else {
		/* Disable the receiver and transmitter */
		usart_disable_tx(obj->p_usart);
		usart_disable_rx(obj->p_usart);
	}
}

/**
 * Set UART baud rate
 */
void serial_baud(serial_t *obj, int baudrate)
{
	usart_set_async_baudrate(obj, (uint32_t)baudrate, sysclk_get_peripheral_hz());
}

/**
 * Set UART format by re-initializing the peripheral.
 */
void serial_format(serial_t *obj, int data_bits, SerialParity parity, int stop_bits)
{
	/* Disable the receiver and transmitter */
	serial_enable_tx(obj, false);
		
	/* We support 5 to 8 data bits */
    MBED_ASSERT(data_bits >= 5 && data_bits <= 8);
	
	/* Set new values */
	obj->serial_options.charlenght = (data_bits - 5) << 6;
	obj->serial_options.paritytype = US_MR_PAR_NO;
	obj->serial_options.stopbits = (stop_bits - 1) << 9;
	switch (parity) {
    case ParityNone:
		obj->serial_options.paritytype = US_MR_PAR_NO;
		break;
    case ParityOdd:
		obj->serial_options.paritytype = US_MR_PAR_ODD;
		break;
    case ParityEven:
		obj->serial_options.paritytype = US_MR_PAR_EVEN;
		break;
    case ParityForced1:
		obj->serial_options.paritytype = US_MR_PAR_MARK;
		break;
    case ParityForced0:
		obj->serial_options.paritytype = US_MR_PAR_SPACE;
		break;
	}

	/* Configure USART in serial mode */
	usart_init_rs232(obj->p_usart, &obj->serial_options, sysclk_get_peripheral_hz());

	/* Enable the receiver and transmitter */
	serial_enable_tx(obj, true);
}

